rottenpotatoes/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 6]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "Nick Park"]]
---
  def movie_with_same_director
    @movie = Movie.find(params[:id])
    if @movie.director.blank?